<template>
    <div class="agreement">
      <p class="content">在以下条款中，“用户”是指向注册成为本公司会员的个人或者单位。
用户同意此在线注册条款之效力如同用户亲自签字、盖章的书面条款一样，对用户具有法律约束力。
用户进入本公司会员注册程序即意味着用户同意了本注册条款的所有内容且只有用户完全同意所有服务条款并完成注册程序，才能成为本公司的正式用户。本注册条款自用户注册成功之日起在用户与本公司之间产生法律效力。
</p>
<p class="title">第一条：&nbsp;&nbsp;用户身份保证</p>
<p class="content">1-1用户承诺并保证自己是具有完全民事行为能力和完全民事权利能力的自然人、法人、实体和组织。用户在此保证所有填写的用户信息是真实、准确、完整、及时的，并且没有任何引人误解或者虚假的陈述，且保证本公司可以通过用户填写的联系方式与用户取得联系。</p>
<p  class="content">1-2用户应根据本公司对于相关服务的要求及时提供相应身份证明等资料，否则本公司有权拒绝向该会员或用户提供相关服务 </p>
<p class="content">1-3用户承诺将及时更新其用户信息以维持该等信息的有效性。</p>
<p class="content">1-4如果用户提供的资料或信息包含有不正确、不真实的信息，本公司保留取消用户会员资格并随时结束为该用户提供服务的权利</p>
<p  class="content">1-5以代理人身份代理其他自然人或者单位进行注册用户必须向本公司提供代理人和被代理人的详细资料和信息及授权书面文件，未向本公司提供上述材料信息及文件的，本公司将视为注册者会员。</p>
<p class="title">第二条:&nbsp;&nbsp;邮件通知</p>
 <p  class="content"> 用户充分理解本公司将通过电子邮件的方式与注册会员保持联络及沟通，用户在此同意本公司通过电子邮件方式向其发送包括会员信息、本公司商品及服务信息在内的相关商业及非商业联络信息。</p>
 <p  class="content">3-1用户注册成功后将得到一个用户名和密码，用户凭用户名和密码享受本公司向会员用户提供的商品和服务。</p>
 <p  class="content">3-2用户将对用户名和密码安全负全部责任，并且用户对其用户名进行的所有活动和事件负全责。用户有权根据本公司规定的程序修改密码。</p>
 <p class="content">3-3非经本公司书面同意，用户名和密码不得擅自转让或者授权他人使用，否则用户应承担由此造成的一切后果。</p>
<p class="content">3-4用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通告本公司。</p>
<p  class="title">第四条&nbsp;&nbsp;服务条款的修改和服务体系修订 </p>
<p class="content">本公司有权在必要时修改服务条款，本公司服务条款一旦发生变动，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以主动取消获得的网络服务。如果用户继续享用本公司网络服务，则视为接受服务条款的变动。本公司保留随时修改其服务体系和价格而不需通知用户的权利，本公司修改其服务和价格体系之前用户就具体服务与本公司达成协议并已按照约定缴纳费用的，本公司将按照已达成的协议执行至已交纳费用的服务期期满。</p>
<p class="title">第五条:&nbsp;&nbsp;本公司的权利和义务</p>
<p  class="content">5-1本公司应根据用户选择的服务以及交纳款项的情况向用户提供合格的网络技术和信息服务。</p>
<p class="content">5-2本公司承诺对用户资料采取对外保密措施，不向第三方披露用户资料，不授权第三方使用用户资料；</p>
<p class="content">5-2-1依据本协议条款或用户与本公司之间其他服务协议、合同、在线条款等规定可以提供；
 </p>
 <p class="content"> 5-2-2依据法律法规的规定应当提供； </p>
 <p  class="content">5-2-3行政、司法等有权部门要求本公司提供；</p>
<p class="content">5-2-4用户同意本公司向第三方提供</p>
<p  class="content">5-2-5 本公司解决举报事件、提起诉讼而提交的；</p>
 <p class="content"> 5-2-6本公司为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提交的； </p>
<p  class="content">5-2-7 本公司为向用户提供产品、服务、信息而向第三方提供的，包括本公司通过第三方的技术及服务向用户提供产品、服务、信息的情况。 </p>
<p  class="content">5-3 本公司有权使用用户资料。 </p>
<p  class="content">5-4 本公司有权利对用户进行审查并决定是否接受用户成为本公司或是否与用户进行某一交易。</p>
<p  class="content">5-5 本公司保留在用户违反国家、地方法律法规或违反本在线注册条款的情况下终止为用户账号的权利，并且在任何情况下，本公司对任何间接、偶然、特殊及继起的损害不负责任。 </p>  
<p class="title"> 第六条: &nbsp;&nbsp;服务的终止</p>
 <p class="content"> 6-1 用户有权随时申请终止其会员资格或其在本公司申请的一项或多项服务，但已交纳款项不得要求退还。 </p>
 <p class="content">6-2 本公司有权根据实际情况决定取消为用户提供的一项或多项服务，但应退还用户为该服务所交纳款项的剩余部分，除此之外本公司不承担任何责任。 </p>
  <p class="title">第七条:&nbsp;&nbsp;争议解决及法律适用 </p>
 <p class="content">7-1因本服务条款有关的一切争议，双方当事人应通过友好协商方式解决。如果协商未成，双方同意向本公司主要经营地的人民法院起诉。</p>
 <p class="content">7-2本注册条款的效力、解释、履行和争议的解决均适用中华人民共和国法律法规和计算机、互联网行业的规范。</p>
 <p class="title">第八条&nbsp;&nbsp;不可抗力</p>
 <p  class="content" >8-1因不可抗力或者其他意外事件，使得本条款履行不可能、不必要或者无意义的，遭受不可抗力意外事件的一方不承担责任。</p>
<p class="content" >8-2不可抗力、意外事件是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。</p>
 <p class="content">8-3用户同意鉴于互联网的特殊性，黑客攻击、互联网连通中断或者系统故障等属于不可抗力，由此用户或第三方造成的损失不应由本公司承担。</p>
 <p  class="title">第九条&nbsp;&nbsp; 附则</p>
 <p class="content">9-1本注册条款中有关条款若被权威机构认定为无效，不应影响其他条款的效力，也不影响本服务条款的解释、违约责任及争议解决的有关约定的效力。</p>
 <p class="content">9-2 一方变更通知、通讯地址或其他联系方式，应自变更之日起及时将变更后的地址、联系方式通知另一方，否则变更方应对此造成的一切后果承担责任。用户同意，本公司的有关通知只需要在本公司有关网页上发布即视为送达用户。</p>
<p class="content">9-3因本公司上市、被收购、与第三方合并、名称变更等事由，用户同意本公司可以将其权利或义务转让给相应的本公司权利义务的承受者。</p>
<p class="content" style="color:#000">
用户在此再次保证已经完全阅读并理解了上述会员注册条款并自愿正式进入中国本公司会员在线注册程序，接受上述所有条款的约束。
</p>
  </div>
</template>

<script>
export default {}
</script>

<style scope>
.content {
  font-size: 28rpx;
  color: #666;
  line-height: 2;
  margin: 30rpx;
  text-indent: 40rpx;
}
.title {
  text-align: center;
  color: #000;
  font-size: 32rpx;
  font-weight: 500;
}
</style>
